# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [3]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [4]:
conn = sqlite3.connect("C:\\Users\\princ\\Db-IMDB-Assignment(1).db")

#### Overview of all tables

In [5]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [6]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [6]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """
SELECT m.title, p.Name, CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) n FROM Genre ge
JOIN M_Genre mg 
ON ge.GID = mg.GID
JOIN Movie m
ON mg.MID= m.MID
JOIN M_Director md
ON m.MID=md.MID
JOIN Person p
ON md.PID=p.PID
WHERE ge.Name LIKE '%Comedy%' AND (n%4=0 AND n % 100 <> 0 OR n % 400 = 0)"""

grader_1(query1)

                          title                   Name     n
0                    Hera Pheri          Prakash Mehra  1976
1                       Deewana             Raj Kanwar  1992
2                    Hera Pheri           Priyadarshan  2000
3                 Gora Aur Kala           Naresh Kumar  1972
4  My Name Is Anthony Gonsalves          Eeshwar Nivas  2008
5                Singh Is Kinng           Anees Bazmee  2008
6           Mr. White Mr. Black   Deepak S. Shivdasani  2008
7            Gangs of Wasseypur         Anurag Kashyap  2012
8                        Mithya           Rajat Kapoor  2008
9                  Dulha Dulhan          Ravindra Dave  1964
Wall time: 229 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [7]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))

query2 =  """SELECT p.Name FROM Person p
JOIN M_Cast mc
ON trim(p.PID,' ')=trim(mc.PID, ' ')
WHERE mc.MID IN (SELECT MID FROM
Movie WHERE lower(title)='anand')"""
grader_2(query2)

                Name
0      Rajesh Khanna
1   Amitabh Bachchan
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
Wall time: 541 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [8]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
Wall time: 431 ms

In [9]:
%%time
#https://www.geeksforgeeks.org/sql-intersect-clause/



def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))
"""SELECT p.Name FROM Person p
JOIN M_Cast mc
ON trim(p.PID,' ')=trim(mc.PID, ' ')
WHERE mc.MID IN (SELECT MID FROM
Movie WHERE CAST(SUBSTR(TRIM(year),-4) AS INTEGER)<1970 OR CAST(SUBSTR(TRIM(year),-4) AS INTEGER)>1990 ) """
query3 = """ Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID
INTERSECT 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID
"""
grader_3(query3)

         PID
0  nm0000821
1  nm0003987
2  nm0004334
3  nm0004429
4  nm0004432
5  nm0004433
6  nm0004434
7  nm0004435
8  nm0004564
9  nm0004569
Wall time: 434 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [10]:
%%time
#https://www.w3schools.com/sql/sql_groupby.asp


def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""SELECT PID, COUNT(MID) 
FROM M_Director 
GROUP BY PID ORDER BY COUNT(MID)"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  COUNT(MID)
0  nm0000180           1
1  nm0000187           1
2  nm0000229           1
3  nm0000269           1
4  nm0000386           1
5  nm0000965           1
6  nm0001060           1
7  nm0001162           1
8  nm0001241           1
9  nm0001355           1
True
Wall time: 56.6 ms

In [11]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ SELECT p.Name, s1.c 
FROM Person p
INNER JOIN
(SELECT trim(PID) pd, COUNT(MID) c
FROM M_Director 
GROUP BY pd HAVING c>=10) s1
ON s1.pd=trim(p.PID) ORDER BY s1.c DESC"""
grader_4(query4)

                    Name   c
0           David Dhawan  39
1           Mahesh Bhatt  35
2        Ram Gopal Varma  30
3           Priyadarshan  30
4           Vikram Bhatt  29
5   Hrishikesh Mukherjee  27
6            Yash Chopra  21
7         Shakti Samanta  19
8        Basu Chatterjee  19
9           Subhash Ghai  18
Wall time: 29.9 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [15]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" SELECT TRIM(DISTINCT mc.MID) mid , p.Gender gender, COUNT(p.Gender) Number_cast FROM M_Cast mc
JOIN Person p
ON trim(mc.PID)= p.PID
GROUP BY gender, mid"""

print(grader_5aa(query_5aa))

         mid gender  Number_cast
0  tt0021594   None            0
1  tt0026274   None            0
2  tt0027256   None            0
3  tt0033616   None            0
4  tt0038491   None            0
5  tt0039654   None            0
6  tt0040067   None            0
7  tt0041123   None            0
8  tt0041161   None            0
9  tt0043078   None            0
True
Wall time: 12min 3s

'def grader_5ab(query_5ab):\n    query_5ab = pd.read_sql_query(query_5ab,conn)\n    print(query_5ab.head(10)) \n    return (query_5ab.shape == (3469, 3))\n\nquery_5ab =""" *** Write your query that will have at least one male actor try to use query that you have written above *** """\n\nprint(grader_5ab(query_5ab))\n\n\n# using the above queries, you can write the answer to the given question'

In [69]:
def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" WITH gender_count AS
(SELECT TRIM(DISTINCT mc.MID) mid , p.Gender gender, COUNT(p.Gender) Number_cast FROM M_Cast mc
JOIN Person p
ON trim(mc.PID)=trim(p.PID)
GROUP BY gender, mid) 
SELECT mid, gender, Number_cast
FROM gender_count
WHERE gender='Male' AND Number_cast>=1 """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         mid gender  Number_cast
0  tt0021594   Male            5
1  tt0026274   Male            9
2  tt0027256   Male            8
3  tt0028217   Male            7
4  tt0031580   Male           27
5  tt0033616   Male           46
6  tt0036077   Male           11
7  tt0038491   Male            7
8  tt0039654   Male            6
9  tt0040067   Male           10
True

In [6]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """WITH s2 AS(WITH gender_count AS
(SELECT TRIM(DISTINCT mc.MID) mid , p.Gender gender, COUNT(p.Gender) Number_cast FROM M_Cast mc
JOIN Person p
ON trim(mc.PID)=trim(p.PID)
GROUP BY gender, mid) 
SELECT mid, gender, Number_cast
FROM gender_count
WHERE gender IN ('Male', 'None'))

SELECT CAST(SUBSTR(m.year,-4) AS Integer), COUNT(DISTINCT m.MID)
FROM Movie m WHERE m.MID NOT IN (SELECT ss.mid FROM s2 AS ss)
GROUP BY CAST(SUBSTR(m.year,-4) AS Integer)"""
grader_5a(query5a)

   CAST(SUBSTR(m.year,-4) AS Integer)  COUNT(DISTINCT m.MID)
0                                1939                      1
1                                1999                      1
2                                2000                      1
3                                2018                      1
Wall time: 12min 37s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [10]:
%%time
#https://www.w3schools.com/sql/sql_isnull.asp
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ WITH s2 AS(WITH gender_count AS
(SELECT TRIM(DISTINCT mc.MID) mid , p.Gender gender, COUNT(p.Gender) Number_cast FROM M_Cast mc
JOIN Person p
ON trim(mc.PID)=trim(p.PID)
GROUP BY gender, mid) 
SELECT mid, gender, Number_cast
FROM gender_count
WHERE gender IN ('Male', 'None')),

num_feamale_movies_year AS
(SELECT CAST(SUBSTR(m.year,-4) AS Integer) yyy, COUNT(DISTINCT m.MID) female_mov
FROM Movie m WHERE m.MID NOT IN (SELECT ss.mid FROM s2 AS ss)
GROUP BY CAST(SUBSTR(m.year,-4) AS Integer)),

movies_per_year AS
(SELECT CAST(SUBSTR(m.year,-4) AS Integer) yy, COUNT(DISTINCT TRIM(m.MID)) m_mid
FROM Movie m
GROUP BY yy)

SELECT nfmy.yyy, (IFNULL(nfmy.female_mov, 0)*100)/mpy.m_mid female_percent, mpy.m_mid
FROM num_feamale_movies_year nfmy
LEFT OUTER JOIN
movies_per_year mpy
ON nfmy.yyy =  mpy.yy
ORDER BY female_percent 

"""
grader_5b(query5b)

    yyy  female_percent  m_mid
0  2018               0    104
1  1999               1     66
2  2000               1     64
3  1939              50      2
Wall time: 30min 22s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [14]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ SELECT m.title, COUNT(DISTINCT TRIM(p.PID)) cast_size  
FROM Person p
JOIN M_cast mc
ON TRIM(p.PID)=TRIM(mc.PID)
JOIN Movie m
ON TRIM(mc.MID) = TRIM(m.MID)
GROUP BY m.MID ORDER BY cast_size DESC"""
grader_6(query6)

                        title  cast_size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
Wall time: 16min 53s

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [13]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """ SELECT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) yy, count(MID) 
FROM Movie GROUP BY yy"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

     yy  count(MID)
0  1931           1
1  1936           3
2  1939           2
3  1941           1
4  1943           1
5  1946           2
6  1947           2
7  1948           3
8  1949           3
9  1950           2
Wall time: 11 ms

In [18]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """SELECT t1.yy movie_year_1, t1.cc total_movies_1, t2.yy movie_year_2,
t2.cc count_2 FROM    
     (SELECT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) yy, count(MID) cc
FROM Movie GROUP BY yy) t1 
JOIN (SELECT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) yy, count(MID) cc
FROM Movie GROUP BY yy) t2
WHERE t2.yy<= t1.yy +9 AND t2.yy>= t1.yy
          """
#Write a query that will do joining of the above table(7a) with itself 
 #   such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year'
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   movie_year_1  total_movies_1  movie_year_2  count_2
0          1931               1          1931        1
1          1931               1          1936        3
2          1931               1          1939        2
3          1936               3          1936        3
4          1936               3          1939        2
5          1936               3          1941        1
6          1936               3          1943        1
7          1939               2          1939        2
8          1939               2          1941        1
9          1939               2          1943        1
Wall time: 20.1 ms

In [48]:
%%time

#https://github.com/BhargavTumu/SQL-Practice-Questions/blob/master/Solutions.sql
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ WITH t1 AS (SELECT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) yy, count(MID) cc
FROM Movie GROUP BY yy),
decade_years AS
(SELECT t1.yy just_year,
t1.yy start_of_decade,
t1.yy+9 end_of_decade,
'Decade of:' || SUBSTR(t1.yy,-4) Decade 
FROM t1
),
movie_count AS
(SELECT SUM(t1.cc) movies_sum, dd.Decade
FROM t1, decade_years dd
WHERE t1.yy BETWEEN dd.start_of_decade AND dd.end_of_decade
GROUP BY dd.decade)
SELECT movies_sum, Decade
FROM movie_count
WHERE movies_sum=(SELECT MAX(movies_sum) FROM movie_count)


"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   movies_sum          Decade
0        1203  Decade of:2008
Wall time: 23.3 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [11]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))

query8a = """SELECT TRIM(mc.PID) actor, TRIM(md.PID) director, COUNT(DISTINCT TRIM(mc.MID)) movie_count 
FROM M_Cast AS mc
JOIN M_Director AS md
ON TRIM(mc.MID)=TRIM(md.MID)
GROUP BY actor, director"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

       actor   director  movie_count
0  nm0000002  nm0496746            1
1  nm0000027  nm0000180            1
2  nm0000039  nm0896533            1
3  nm0000042  nm0896533            1
4  nm0000047  nm0004292            1
5  nm0000073  nm0485943            1
6  nm0000076  nm0000229            1
7  nm0000092  nm0178997            1
8  nm0000093  nm0000269            1
9  nm0000096  nm0113819            1
(73408, 3)
Wall time: 2min 29s

In [ ]:
%%time
#https://www.w3schools.com/sql/sql_case.asp
def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """ 
WITH yash_pid AS
(SELECT TRIM(p.PID) pid FROM Person
WHERE TRIM(p.Name) = 'Yash Chopra'),

num_of_movies_ad AS
(SELECT TRIM(mc.PID) actor, TRIM(md.PID) director, COUNT(DISTINCT TRIM(mc.MID)) movie_count 
FROM M_Cast AS mc
JOIN M_Director AS md
ON TRIM(mc.MID)=TRIM(md.MID)
GROUP BY actor, director),

yash_movies AS
(SELECT nm.actor ym_act, nm.director, nm.movie_count yash_m
FROM num_of_movies_ad nm,
yash_pid y_pid
WHERE nm.director = y_pid.pid),

actor_other_director_max AS
(SELECT nm.actor nm_act, MAX(nm.movie_count) max_movie
FROM num_of_movies_ad nm,
yash_pid y_pid
WHERE nm.director <> y_pid.pid
GROUP BY nm.actor, nm.director ),

compare AS
(SELECT mad.nm_act act_yc, CASE WHEN ym.yash_m > IFNULL(mad.max_movie, 0) THEN 'yes' ELSE 'no' END yes_or_no
FROM yash_movies ym
LEFT OUTER JOIN
actor_other_director_max mad
ON ym.ym_act = mad.nm_act)

SELECT DISTINCT TRIM(p.Name) actor_name
FROM Person p
WHERE p.PID IN (SELECT DISTINCT com.act_yc 
FROM compare com 
WHERE com.yes_or_no = 'yes')
"""
grader_8(query8)

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [17]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ 

WITH pid_s AS
(SELECT TRIM(PID) pp, Name FROM  Person
WHERE
Trim(NAME) = "Shah Rukh Khan" ),

s1 AS
(SELECT DISTINCT TRIM(mc.MID) mm, s1.pp 
FROM M_Cast mc, pid_s s1
WHERE TRIM(mc.PID) = s1.pp ) 

SELECT DISTINCT TRIM(mc.PID) s1_pid FROM M_Cast mc, s1 pps
WHERE TRIM(mc.MID) = pps.mm AND 
TRIM(mc.PID) <> pps.pp

"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1).
# selecting all movies where S1 actors acted, this forms S2 movies list.
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      s1_pid
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 162 ms

In [ ]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

'''query9 = """ WITH pid_s AS
(SELECT TRIM(PID) pp, Name FROM  Person
WHERE
Trim(NAME) = "Shah Rukh Khan" ),

s_movies AS
(SELECT DISTINCT TRIM(mc.MID) mm, s1.pp 
FROM M_Cast mc, pid_s s1
WHERE TRIM(mc.PID) = s1.pp ), 

s_actor_pid AS
(SELECT DISTINCT TRIM(mc.PID) s1_pid FROM M_Cast mc, s_movies pps
WHERE TRIM(mc.MID) = pps.mm AND 
TRIM(mc.PID) <> pps.pp),

s_2_mid AS
(SELECT DISTINCT TRIM(mc.MID) s2_mid, act_pid.s1_pid s2_pid
FROM M_Cast mc,
s_actor_pid act_pid,
s_movies sm
WHERE TRIM(mc.PID) = act_pid.s1_pid AND TRIM(mc.MID)<>sm.mm)



SELECT TRIM(p.Name) FROM 
Person p, pid_s pids WHERE p.PID IN
(SELECT DISTINCT p.PID
FROM Person P INNER JOIN
M_Cast mc
ON TRIM(mc.PID)= TRIM(p.PID)
INNER JOIN
s_2_mid s2
ON TRIM(mc.MID) =s2.s2_mid 
WHERE 
TRIM(mc.PID) <> s2.s2_pid ) AND p.PID NOT IN (pids.pp)"""'''
grader_9(query9)

In [25]:
query9 = """ WITH pid_s AS
(SELECT TRIM(PID) pp, Name FROM  Person
WHERE
Trim(NAME) = "Shah Rukh Khan" ),

sharuk_movies AS
(SELECT DISTINCT TRIM(mc.MID) mm
FROM M_Cast mc, pid_s s1
WHERE TRIM(mc.PID) = s1.pp ),

sharuk_coactors AS
(SELECT DISTINCT TRIM(mc.PID) act_pid 
FROM M_CAST mc, sharuk_movies sm, pid_s pids
WHERE TRIM(mc.MID) = sm.mm AND TRIM(mc.PID)<>pids.pp),

sharuk_coactors_movies AS
(SELECT DISTINCT TRIM(mc.MID) mid, TRIM(mc.PID) mcpid 
FROM M_Cast mc, sharuk_movies sm, pid_s pids, sharuk_coactors sc
WHERE TRIM(mc.PID)= sc.act_pid AND TRIM(mc.MID)<> sm.mm)

SELECT p.Name FROM Person p 
WHERE p.PID IN (SELECT DISTINCT TRIM(mc.PID) 
FROM M_Cast mc, sharuk_coactors_movies scm, sharuk_coactors sc, sharuk_movies sm
WHERE TRIM(mc.MID) = scm.mid AND TRIM(mc.PID)<> sc.act_pid AND TRIM(mc.PID)= scm.mcpid AND TRIM(mc.MID)<>sm.mm)





"""